---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
UIDocument..::..SaveAs Method
UIDocument Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | SaveAs()()()() | Saves the document to a file name obtained from the Revit user without prompting the user to overwrite file if it exists. |
|  | SaveAs(UISaveAsOptions) | Saves the document to a file name obtained from the Revit user optionally prompting the user to overwrite file if it exists. |

# See Also

UIDocument Class

UIDocument Members

Autodesk.Revit.UI Namespace